Revit 2026 API

# ConnectorDisconnectFrom Method

---

Remove connection between two connectors.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DisconnectFrom(
	Connector connector
)
```
```vb
Public Sub DisconnectFrom (
	connector As Connector
)
```
```cpp
public:
void DisconnectFrom(
	Connector^ connector
)
```
```fsharp
member DisconnectFrom :
        connector : Connector -> unit
```

#### Parameters

connector Connector
    Indicate the connector, connection will be removed from.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |
| ArgumentException | Argument is invalid. |
| InvalidOperationException | Thrown when no connection between these two connector. Thrown on failure to remove the connection between these two connectors. |

#### Reference

Connector Class

Autodesk.Revit.DB Namespace